bmd/src/libbmdlog/soap_server/tests/ns.logServerSend.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns="ns.xsd">
 <SOAP-ENV:Body>
  <ns:logServerSend>
   <logDatagram>
    <remoteHost></remoteHost>
    <remotePort></remotePort>
    <srcFile></srcFile>
    <srcLine></srcLine>
    <srcFunction></srcFunction>
    <logOwner></logOwner>
    <service></service>
    <operationType></operationType>
    <logLevel></logLevel>
    <dateTimeBegin></dateTimeBegin>
    <logString></logString>
    <logReason></logReason>
    <logSolution></logSolution>
    <documentSize></documentSize>
    <documentFilename></documentFilename>
    <logReferto></logReferto>
    <eventCode></eventCode>
    <logOwnerEventVisible></logOwnerEventVisible>
    <logRefertoEventVisible></logRefertoEventVisible>
   </logDatagram>
  </ns:logServerSend>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
